Джира/src/Documents/Центр_Задача/Центр_Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Центр_Задача</name>
  <comment>Задачи сотрудников</comment>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадачи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.Центр_ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Центр_Партнеры</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Центр_Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавнаяЗадача</name>
    <type>
      <types>DocumentRef.Центр_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выполнен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Метки</name>
    <attributes>
      <name>Метка</name>
      <type>
        <types>CatalogRef.Центр_МеткиЗадач</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Джира/src/InformationRegisters/Центр_ИсполнителиЗадач/Центр_ИсполнителиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Центр_ИсполнителиЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Центр_ГруппыДоступаКЗадачам</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ЗадачаВзята</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Центр_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Джира/src/Enums/Центр_ЕдиницыИзмеренийВремени/Центр_ЕдиницыИзмеренийВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Центр_ЕдиницыИзмеренийВремени</name>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Час</name>
  </enumValues>
</mdclass:Enum>

Джира/src/Documents/Центр_Задача/Forms/ФормаПодтвержденияВзятияЗадачи/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//@skip-check unknown-form-parameter-access
	Если Параметры.Свойство("Задача") Тогда
		Если ЗначениеЗаполнено(Параметры.Задача) Тогда
			Задача=Параметры.Задача;
		КонецЕсли;
	КонецЕсли;	
	//@skip-check unknown-form-parameter-access
	Если Параметры.Свойство("ЭтоДень") Тогда
		Если Параметры.ЭтоДень Тогда
			ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.Центр_ЕдиницыИзмеренийВремени.День");
		Иначе
			ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.Центр_ЕдиницыИзмеренийВремени.Час");
		КонецЕсли;
	КонецЕсли;
	//@skip-check unknown-form-parameter-access
	Если Параметры.Свойство("Дедлайн") Тогда
		Если ЗначениеЗаполнено(Параметры.Дедлайн) Тогда
			Дедлайн=Параметры.Дедлайн;
		КонецЕсли;
	КонецЕсли;
	//@skip-check unknown-form-parameter-access
	Если Параметры.Свойство("Длительность") Тогда
		Если ЗначениеЗаполнено(Параметры.Длительность) Тогда
			Длительность=Параметры.Длительность;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

 
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	ГотовоНаСервере();
	Закрыть();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ГотовоНаСервере()
	Док = Задача.ПолучитьОбъект();
	Док.Длительность = Длительность;
	Док.Дедлайн = Дедлайн;
	Если ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.Центр_ЕдиницыИзмеренийВремени.День") Тогда
		Док.ЭтоДень = Истина;
	Иначе
		Док.ЭтоДень = Ложь;
	КонецЕсли;
	Док.Записать(РежимЗаписиДокумента.Проведение);

	МенеджерЗаписи = РегистрыСведений.Центр_ИсполнителиЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.Исполнитель  = Пользователи.АвторизованныйПользователь();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Записать();
	
	Центр_ОбработкаТриггеров.ТриггерВзятиеЗадачи(Задача);
	
КонецПроцедуры
#КонецОбласти
